package IfElse;

/**
 * 3.Написать программу, делающую обратную операцию перевода, из двоичной в десятеричную.
 */
public class Three {

    public static void main(String[] args) {

        System.out.println(Integer.parseInt("11001100", 2));
    }
}
